## Final Project Submission

Please fill out: 
* Student name: Jeremy Nguyo
* Student pace: full time
* Scheduled project review date/time: 
* Instructor name: William Okomba
* Blog post URL:

## DATA PREPARATION

## Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import KFold
from sklearn.preprocessing import PolynomialFeatures
from sklearn.metrics import mean_squared_error, r2_score

import itertools as it
from statsmodels.regression import linear_model
import statsmodels.api as sm
from statsmodels.formula.api import ols
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

### Load the data

In [2]:
# Preview of the first and last rows of the dataset
df = pd.read_csv('data/kc_house_data.csv')
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,NONE,...,7 Average,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,6414100192,12/9/2014,538000.0,3,2.25,2570,7242,2.0,NO,NONE,...,7 Average,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,5631500400,2/25/2015,180000.0,2,1.00,770,10000,1.0,NO,NONE,...,6 Low Average,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,NO,NONE,...,7 Average,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,NO,NONE,...,8 Good,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21592,263000018,5/21/2014,360000.0,3,2.50,1530,1131,3.0,NO,NONE,...,8 Good,1530,0.0,2009,0.0,98103,47.6993,-122.346,1530,1509
21593,6600060120,2/23/2015,400000.0,4,2.50,2310,5813,2.0,NO,NONE,...,8 Good,2310,0.0,2014,0.0,98146,47.5107,-122.362,1830,7200
21594,1523300141,6/23/2014,402101.0,2,0.75,1020,1350,2.0,NO,NONE,...,7 Average,1020,0.0,2009,0.0,98144,47.5944,-122.299,1020,2007
21595,291310100,1/16/2015,400000.0,3,2.50,1600,2388,2.0,NaN,NONE,...,8 Good,1600,0.0,2004,0.0,98027,47.5345,-122.069,1410,1287
21596,1523300157,10/15/2014,325000.0,2,0.75,1020,1076,2.0,NO,NONE,...,7 Average,1020,0.0,2008,0.0,98144,47.5941,-122.299,1020,1357

In [3]:
# Checked to see the datatype, number of columns and rows of the movie_budgets table
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21597 entries, 0 to 21596
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             21597 non-null  int64
 1   date           21597 non-null  object
 2   price          21597 non-null  float64
 3   bedrooms       21597 non-null  int64
 4   bathrooms      21597 non-null  float64
 5   sqft_living    21597 non-null  int64
 6   sqft_lot       21597 non-null  int64
 7   floors         21597 non-null  float64
 8   waterfront     19221 non-null  object
 9   view           21534 non-null  object
 10  condition      21597 non-null  object
 11  grade          21597 non-null  object
 12  sqft_above     21597 non-null  int64
 13  sqft_basement  21597 non-null  object
 14  yr_built       21597 non-null  int64
 15  yr_renovated   17755 non-null  float64
 16  zipcode        21597 non-null  int64
 17  lat            21597 non-null  float64
 18  long           21597 non-null  float64
 19  sqft_living15  21597 non-null  int64
 20  sqft_lot15     21597 non-null  int64
dtypes: float64(6), int64(9), object(6)
memory usage: 3.5+ MB

In [4]:
# Checked the parameters of the data
df.nunique()

id               21420
date               372
price             3622
bedrooms            12
bathrooms           29
sqft_living       1034
sqft_lot          9776
floors               6
waterfront           2
view                 5
condition            5
grade               11
sqft_above         942
sqft_basement      304
yr_built           116
yr_renovated        70
zipcode             70
lat               5033
long               751
sqft_living15      777
sqft_lot15        8682
dtype: int64

In [5]:
# Get number of missing values in each column
df.isnull().sum()

id                  0
date                0
price               0
bedrooms            0
bathrooms           0
sqft_living         0
sqft_lot            0
floors              0
waterfront       2376
view               63
condition           0
grade               0
sqft_above          0
sqft_basement       0
yr_built            0
yr_renovated     3842
zipcode             0
lat                 0
long                0
sqft_living15       0
sqft_lot15          0
dtype: int64

In [6]:
# Statistical Summary of the data
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,sqft_above,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.159700e+04,2.159700e+04,21597.000000,21597.000000,21597.000000,2.159700e+04,21597.000000,21597.000000,21597.000000,17755.000000,21597.000000,21597.000000,21597.000000,21597.000000,21597.000000
mean,4.580474e+09,5.402966e+05,3.373200,2.115826,2080.321850,1.509941e+04,1.494096,1788.596842,1970.999676,83.636778,98077.951845,47.560093,-122.213982,1986.620318,12758.283512
std,2.876736e+09,3.673681e+05,0.926299,0.768984,918.106125,4.141264e+04,0.539683,827.759761,29.375234,399.946414,53.513072,0.138552,0.140724,685.230472,27274.441950
min,1.000102e+06,7.800000e+04,1.000000,0.500000,370.000000,5.200000e+02,1.000000,370.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.220000e+05,3.000000,1.750000,1430.000000,5.040000e+03,1.000000,1190.000000,1951.000000,0.000000,98033.000000,47.471100,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,1560.000000,1975.000000,0.000000,98065.000000,47.571800,-122.231000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068500e+04,2.000000,2210.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,9410.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

## DATA CLEANING

Check for Validity, Accuracy, Completeness, Consistency and Uniformity of the Data

#### Missing Values

The first thing that stands out are the missing values. The column *yr_renovated* has the largest amount of missing values, followed by *waterfront* and then *view* which has the least number. Further exploration on the missing values is needed before I can determine how to approach them.

In [7]:
# A look at the percentage of missing values
for col in df.columns:
    if df[col].isnull().sum() > 0:
        perc = (df[col].isnull().sum()/len(df[col]))*100
        print("The column", col,"has",df[col].isnull().sum(),"missing values, which is", round(perc, 1),"% of it's total")

The column waterfront has 2376 missing values, which is 11.0 % of it's total
The column view has 63 missing values, which is 0.3 % of it's total
The column yr_renovated has 3842 missing values, which is 17.8 % of it's total

Further inspection of the columns to check the unique values

Waterfront Column

In [8]:
print("The Waterfront Column\n")

print("Number of distinct elements is:", df['waterfront'].nunique(),"\n")

print("This is the count of unique values:")
print(df['waterfront'].value_counts(),"\n")

print('The unique values:')
print(df['waterfront'].unique(),"\n")

print("Number of missing values:",df['waterfront'].isnull().sum())

The Waterfront Column

Number of distinct elements is: 2

This is the count of unique values:
NO     19075
YES      146
Name: waterfront, dtype: int64

The unique values:
[nan 'NO' 'YES']

Number of missing values: 2376

The most common value in this column is *NO*. Most of these houses don't have a waterfront hence it's safe to assume that the ones with missing values also don't have a waterfront. Therefore, I will replace the missing values with *NO*

In [9]:
# replace missing values
df['waterfront'].fillna('NO',inplace=True)

# confirm if the missing values have been replaced
df['waterfront'].value_counts()

NO     21451
YES      146
Name: waterfront, dtype: int64

View Column

In [10]:
print("The View Column\n")

print("Number of distinct elements is:", df['view'].nunique(),"\n")

print("This is the count of unique values:")
print(df['view'].value_counts(),"\n")

print('The unique values:')
print(df['view'].unique(),"\n")

print("Number of missing values:",df['view'].isnull().sum())

The View Column

Number of distinct elements is: 5

This is the count of unique values:
NONE         19422
AVERAGE        957
GOOD           508
FAIR           330
EXCELLENT      317
Name: view, dtype: int64

The unique values:
['NONE' nan 'GOOD' 'EXCELLENT' 'AVERAGE' 'FAIR']

Number of missing values: 63

The most common value in this column is *NONE*. So this means most of the houses don't have a view. It's safe to assume the 63 missing values also don't have a view. Therefore, I will replace the missing values with *NONE*

In [11]:
# replace missing values
df['view'].fillna('NONE',inplace=True)

# confirm if the missing values have been replaced
df['view'].value_counts()

NONE         19485
AVERAGE        957
GOOD           508
FAIR           330
EXCELLENT      317
Name: view, dtype: int64

Year Renovated Column

In [12]:
print("The yr_renovated Column\n")

print("Number of distinct elements is:", df['yr_renovated'].nunique(),"\n")

print("This is the count of unique values:")
print(df['yr_renovated'].value_counts(),"\n")

print('The unique values:')
print(df['yr_renovated'].unique(),"\n")

print("Number of missing values:",df['yr_renovated'].isnull().sum())

The yr_renovated Column

Number of distinct elements is: 70

This is the count of unique values:
0.0       17011
2014.0       73
2013.0       31
2003.0       31
2007.0       30
          ...
1951.0        1
1953.0        1
1946.0        1
1976.0        1
1948.0        1
Name: yr_renovated, Length: 70, dtype: int64

The unique values:
[   0. 1991.   nan 2002. 2010. 1992. 2013. 1994. 1978. 2005. 2003. 1984.
 1954. 2014. 2011. 1983. 1945. 1990. 1988. 1977. 1981. 1995. 2000. 1999.
 1998. 1970. 1989. 2004. 1986. 2007. 1987. 2006. 1985. 2001. 1980. 1971.
 1979. 1997. 1950. 1969. 1948. 2009. 2015. 1974. 2008. 1968. 2012. 1963.
 1951. 1962. 1953. 1993. 1996. 1955. 1982. 1956. 1940. 1976. 1946. 1975.
 1964. 1973. 1957. 1959. 1960. 1967. 1965. 1934. 1972. 1944. 1958.]

Number of missing values: 3842

The most common value in this column is *0.0*. The years run from 1948 to 2014. Based on this data only, it's not possible to know what *0.0* stands for. For now we'll have the missing values as *0.0*

In [13]:
# replace missing values
df['yr_renovated'].fillna(0.0,inplace=True)

# confirm if the missing values have been replaced
df['yr_renovated'].value_counts()

0.0       20853
2014.0       73
2013.0       31
2003.0       31
2007.0       30
          ...
1951.0        1
1953.0        1
1946.0        1
1976.0        1
1948.0        1
Name: yr_renovated, Length: 70, dtype: int64

In [14]:
# check to see if there are any missing values
df.isnull().sum()

id               0
date             0
price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
grade            0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
zipcode          0
lat              0
long             0
sqft_living15    0
sqft_lot15       0
dtype: int64

#### Conversion of Date Column and Creation of New Columns

The date column represents the month and year the houses were sold. So we create new columns: *yr_sold* and *month_sold*

In [15]:
# split the date into month, day and year
date = df['date'].str.split('/', expand=True)

# create new columns for month and year and convert to integer
df['month_sold'] = date[0].astype(int)
df['yr_sold'] = date[2].astype(int)

# drop original date column
df.drop(columns=['date'], axis=1, inplace=True)

# check to see if changed were made
df.head()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,...,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,month_sold,yr_sold
0,7129300520,221900.0,3,1.00,1180,5650,1.0,NO,NONE,Average,...,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650,10,2014
1,6414100192,538000.0,3,2.25,2570,7242,2.0,NO,NONE,Average,...,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639,12,2014
2,5631500400,180000.0,2,1.00,770,10000,1.0,NO,NONE,Average,...,0.0,1933,0.0,98028,47.7379,-122.233,2720,8062,2,2015
3,2487200875,604000.0,4,3.00,1960,5000,1.0,NO,NONE,Very Good,...,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000,12,2014
4,1954400510,510000.0,3,2.00,1680,8080,1.0,NO,NONE,Average,...,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503,2,2015

Create new column *age* to represent the age of the house. To get the age of the house, I got the difference between the *yr_built* and the year 2015. We have data for houses until the year 2015, so I based the age on this.

In [16]:
# create new column 'age'
df['age'] = 2015 - df['yr_built']

# drop the column for yr_built since it's not useful anymore
df.drop(columns=['yr_built'], axis=1, inplace=True)

# check to see if changes were made
df

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,...,sqft_basement,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,month_sold,yr_sold,age
0,7129300520,221900.0,3,1.00,1180,5650,1.0,NO,NONE,Average,...,0.0,0.0,98178,47.5112,-122.257,1340,5650,10,2014,60
1,6414100192,538000.0,3,2.25,2570,7242,2.0,NO,NONE,Average,...,400.0,1991.0,98125,47.7210,-122.319,1690,7639,12,2014,64
2,5631500400,180000.0,2,1.00,770,10000,1.0,NO,NONE,Average,...,0.0,0.0,98028,47.7379,-122.233,2720,8062,2,2015,82
3,2487200875,604000.0,4,3.00,1960,5000,1.0,NO,NONE,Very Good,...,910.0,0.0,98136,47.5208,-122.393,1360,5000,12,2014,50
4,1954400510,510000.0,3,2.00,1680,8080,1.0,NO,NONE,Average,...,0.0,0.0,98074,47.6168,-122.045,1800,7503,2,2015,28
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
21592,263000018,360000.0,3,2.50,1530,1131,3.0,NO,NONE,Average,...,0.0,0.0,98103,47.6993,-122.346,1530,1509,5,2014,6
21593,6600060120,400000.0,4,2.50,2310,5813,2.0,NO,NONE,Average,...,0.0,0.0,98146,47.5107,-122.362,1830,7200,2,2015,1
21594,1523300141,402101.0,2,0.75,1020,1350,2.0,NO,NONE,Average,...,0.0,0.0,98144,47.5944,-122.299,1020,2007,6,2014,6
21595,291310100,400000.0,3,2.50,1600,2388,2.0,NO,NONE,Average,...,0.0,0.0,98027,47.5345,-122.069,1410,1287,1,2015,11
21596,1523300157,325000.0,2,0.75,1020,1076,2.0,NO,NONE,Average,...,0.0,0.0,98144,47.5941,-122.299,1020,1357,10,2014,7

In [19]:
# drop ID column as it's not useful in this analysis
df.drop(columns='id', axis=1, inplace=True)

## DATA ANALYSIS

The target variable here is price, which is the sale price of the houses. The dataset contains many different potential predictors, so let's see the correlation with the target variable.

In [20]:
df.corr()['price']

price            1.000000
bedrooms         0.308787
bathrooms        0.525906
sqft_living      0.701917
sqft_lot         0.089876
floors           0.256804
sqft_above       0.605368
yr_renovated     0.117855
zipcode         -0.053402
lat              0.306692
long             0.022036
sqft_living15    0.585241
sqft_lot15       0.082845
month_sold      -0.009928
yr_sold          0.003727
age             -0.053953
Name: price, dtype: float64

Since correlation is a measure related to regression modeling, we can see that there seems to be some relevant signal here, with lots of variables that have medium-to-strong correlations with price.

### Simple Linear Regression